tap "koekeishiya/formulae"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Post-modern modal text editor
brew "helix"
# Language Server Protocol for Markdown
brew "marksman"
# Node version management
brew "n"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Libraries for security-enabled client and server applications
brew "nss"
# General-purpose scripting language
brew "php@8.4"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line deletion tool focused on safety, ergonomics, and performance
brew "rm-improved"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# Build, run, and manage Symfony applications
brew "symfony-cli"
# TOML toolkit written in Rust
brew "taplo"
# Internet file retriever
brew "wget"
# Language Server for Yaml Files
brew "yaml-language-server"
# UNIX shell (command interpreter)
brew "zsh"
# Feature-rich syntax highlighting for Zsh
brew "zsh-fast-syntax-highlighting"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# JetBrains tools manager
cask "jetbrains-toolbox"
# ZSA keyboard firmware flasher
cask "keymapp"
# Window snapping tool
cask "rectangle-pro"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
go "github.com/codesenberg/bombardier"
cargo "systemd-lsp"
npm "@ansible/ansible-language-server"
npm "@microsoft/compose-language-service"
npm "bash-language-server"
npm "corepack"
npm "dockerfile-language-server-nodejs"
npm "typescript-language-server"
npm "typescript"
npm "vscode-langservers-extracted"
