tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "symfony-cli/tap"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# General-purpose scripting language
brew "php", restart_service: true
# Dependency Manager for PHP
brew "composer"
# .NET Core
brew "dotnet"
# Modern, maintained replacement for ls
brew "eza"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Node version management
brew "n"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Libraries for security-enabled client and server applications
brew "nss"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line deletion tool focused on safety, ergonomics, and performance
brew "rm-improved"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Zsh prompt for Astronauts
brew "spaceship"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Feature-rich syntax highlighting for Zsh
brew "zsh-fast-syntax-highlighting"
# Symfony CLI helps Symfony developers manage projects, from local code to remote infrastructure
brew "symfony-cli/tap/symfony-cli"
# Database version management tool
cask "dbngin"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Game development engine
cask "godot"
# Web browser
cask "google-chrome"
# JetBrains tools manager
cask "jetbrains-toolbox"
# ZSA keyboard firmware flasher
cask "keymapp"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Window snapping tool
cask "rectangle-pro"
# Music streaming service
cask "spotify"
# Multimedia player
cask "vlc"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Video communication and virtual meeting platform
cask "zoom"
